Revit 2026 API

# PointRelativeToPoint Methods

---

The PointRelativeToPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetHostPointReference | Get a copy of the host point reference. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetHostPointReference | Change the host point reference. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

PointRelativeToPoint Class

Autodesk.Revit.DB Namespace